# Groupby

O método groupby permite agrupar linhas de dados em conjunto e chamar funções agregadas

In [1]:
import pandas as pd
# Cria um DataFrame
data = {'Classe':['Júnior','Júnior','Pleno','Pleno','Sênior','Sênior'],
       'Nome':['Jorge','Carlos','Roberta','Patrícia','Bruno','Vera'],
       'Venda':[200,120,340,124,243,350]}

In [2]:
df = pd.DataFrame(data)

In [3]:
df

   Classe      Nome  Venda
0  Júnior     Jorge    200
1  Júnior    Carlos    120
2   Pleno   Roberta    340
3   Pleno  Patrícia    124
4  Sênior     Bruno    243
5  Sênior      Vera    350

O método .group by () agrupa as linhas em conjunto com base em um nome de coluna. retorna um objeto DataFrameGroupBy

In [4]:
df.groupby('Classe')# Agrupando com base na classe

In [5]:
classes = df.groupby("Classe")

## Operações

In [6]:
classes.sum()

        Venda
Classe
Júnior    320
Pleno     464
Sênior    593

In [7]:
classes.mean()

        Venda
Classe
Júnior  160.0
Pleno   232.0
Sênior  296.5

In [8]:
df.groupby('Classe').mean()

        Venda
Classe
Júnior  160.0
Pleno   232.0
Sênior  296.5

In [9]:
classes.min()

            Nome  Venda
Classe
Júnior    Carlos    120
Pleno   Patrícia    124
Sênior     Bruno    243

In [10]:
classes.max()

           Nome  Venda
Classe
Júnior    Jorge    200
Pleno   Roberta    340
Sênior     Vera    350

In [11]:
classes.count()

        Nome  Venda
Classe
Júnior     2      2
Pleno      2      2
Sênior     2      2

In [12]:
classes.std()

             Venda
Classe
Júnior   56.568542
Pleno   152.735065
Sênior   75.660426

## Describe

In [13]:
classes.describe()

       Venda
       count   mean         std    min     25%    50%     75%    max
Classe
Júnior   2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
Pleno    2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0
Sênior   2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0

In [14]:
classes.describe().transpose()

Classe           Júnior       Pleno      Sênior
Venda count    2.000000    2.000000    2.000000
      mean   160.000000  232.000000  296.500000
      std     56.568542  152.735065   75.660426
      min    120.000000  124.000000  243.000000
      25%    140.000000  178.000000  269.750000
      50%    160.000000  232.000000  296.500000
      75%    180.000000  286.000000  323.250000
      max    200.000000  340.000000  350.000000

In [15]:
df2 = df.copy()

## CUIDADO

In [16]:
df3 = df2#df3 = ponteiro!!!!

In [17]:
df2

   Classe      Nome  Venda
0  Júnior     Jorge    200
1  Júnior    Carlos    120
2   Pleno   Roberta    340
3   Pleno  Patrícia    124
4  Sênior     Bruno    243
5  Sênior      Vera    350

In [18]:
df3['Vendas'] = [150, 250,500, 200, 144, 333]

In [19]:
df2

   Classe      Nome  Venda  Vendas
0  Júnior     Jorge    200     150
1  Júnior    Carlos    120     250
2   Pleno   Roberta    340     500
3   Pleno  Patrícia    124     200
4  Sênior     Bruno    243     144
5  Sênior      Vera    350     333

Usar o metodo copy

In [20]:
df4 = df2.copy()

In [21]:
df4['Vendas'] = [5, 5,5, 5, 5, 5]

In [22]:
df4

   Classe      Nome  Venda  Vendas
0  Júnior     Jorge    200       5
1  Júnior    Carlos    120       5
2   Pleno   Roberta    340       5
3   Pleno  Patrícia    124       5
4  Sênior     Bruno    243       5
5  Sênior      Vera    350       5

In [23]:
df2

   Classe      Nome  Venda  Vendas
0  Júnior     Jorge    200     150
1  Júnior    Carlos    120     250
2   Pleno   Roberta    340     500
3   Pleno  Patrícia    124     200
4  Sênior     Bruno    243     144
5  Sênior      Vera    350     333

## CONCAT

In [25]:
df_conjunto = pd.concat([df2,df4])

In [26]:
df_conjunto

   Classe      Nome  Venda  Vendas
0  Júnior     Jorge    200     150
1  Júnior    Carlos    120     250
2   Pleno   Roberta    340     500
3   Pleno  Patrícia    124     200
4  Sênior     Bruno    243     144
5  Sênior      Vera    350     333
0  Júnior     Jorge    200       5
1  Júnior    Carlos    120       5
2   Pleno   Roberta    340       5
3   Pleno  Patrícia    124       5
4  Sênior     Bruno    243       5
5  Sênior      Vera    350       5

In [31]:
df.groupby(['Classe', 'Nome'])

In [33]:
df.groupby(['Classe', 'Nome']).sum()

                 Venda
Classe Nome
Júnior Carlos      120
       Jorge       200
Pleno  Patrícia    124
       Roberta     340
Sênior Bruno       243
       Vera        350

In [27]:
df.groupby(['Classe', 'Nome']).mean()

                 Venda
Classe Nome
Júnior Carlos    120.0
       Jorge     200.0
Pleno  Patrícia  124.0
       Roberta   340.0
Sênior Bruno     243.0
       Vera      350.0